run/damBreak4phase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          195;
        startFace       68014;
    }
    rightWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          195;
        startFace       68209;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          206;
        startFace       68404;
    }
    atmosphere
    {
        type            patch;
        nFaces          176;
        startFace       68610;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          68400;
        startFace       68786;
    }
)

// ************************************************************************* //
